# vstGetCurrPt3D

## Description
```pascal
PROCEDURE vstGetCurrPt3D(
				VAR outX : REAL;
				VAR outY : REAL;
				VAR outZ : REAL;
				result   : BOOLEAN);
```

```python

def vs.vstGetCurrPt3D(result):
    return (outX, outY, outZ)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outX|REAL||
|outY|REAL||
|outZ|REAL||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events